app/views/lessons/show.html.erb

SELECT "standards".* FROM "standards" INNER JOIN "lesson_standards" ON "standards"."code" = "lesson_standards"."standard_code" WHERE "lesson_standards"."lesson_id" = 4
---
      <ul class="standards-list">
        <% @lesson.standards.each do |standard| %>

SELECT "formative_assignments".* FROM "formative_assignments" WHERE "formative_assignments"."lesson_id" = 5
SELECT 1 AS one FROM "formative_assignments" WHERE "formative_assignments"."lesson_id" = 3 LIMIT 1
---

  <% if @lesson.formative_assignments.any? %>

SELECT "formative_assignments".* FROM "formative_assignments" WHERE "formative_assignments"."lesson_id" = 5
---
      <ul>
        <% @lesson.formative_assignments.each do |fa| %>

SELECT "summative_assignments".* FROM "summative_assignments" WHERE "summative_assignments"."lesson_id" = 5
SELECT 1 AS one FROM "summative_assignments" WHERE "summative_assignments"."lesson_id" = 4 LIMIT 1
---

  <% if @lesson.summative_assignments.any? %>

SELECT "summative_assignments".* FROM "summative_assignments" WHERE "summative_assignments"."lesson_id" = 5
---
      <ul>
        <% @lesson.summative_assignments.each do |sa| %>

SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."lesson_id" = 5
SELECT 1 AS one FROM "quizzes" WHERE "quizzes"."lesson_id" = 4 LIMIT 1
---

  <% if @lesson.quizzes.any? %>

SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."lesson_id" = 5
---
      <ul>
        <% @lesson.quizzes.each do |quiz| %>