app/controllers/formative_assignments_controller.rb

  def set_quarter
    @quarter = Quarter.find(params[:quarter_id])
---
SELECT "quarters".* FROM "quarters" WHERE "quarters"."id" = 1 LIMIT 1

  def set_lesson
    @lesson = @quarter.lessons.find(params[:lesson_id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."quarter_id" = 1 AND "lessons"."id" = 5 LIMIT 1

  def set_formative_assignment
    @formative_assignment = @lesson.formative_assignments.find(params[:id])
---
SELECT "formative_assignments".* FROM "formative_assignments" WHERE "formative_assignments"."lesson_id" = 5 AND "formative_assignments"."id" = 1 LIMIT 1