app/controllers/lessons_controller.rb

  def set_quarter
    @quarter = Quarter.find(params[:quarter_id])
---
SELECT "quarters".* FROM "quarters" WHERE "quarters"."id" = 1 LIMIT 1

  def set_lesson
    @lesson = @quarter.lessons.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."quarter_id" = 1 AND "lessons"."id" = 1 LIMIT 1