app/controllers/lesson_standards_controller.rb

INSERT INTO "lesson_standards" ("lesson_id", "standard_code", "created_at", "updated_at") VALUES (4, '7.1.1', '2025-07-10 06:54:57.313218', '2025-07-10 06:54:57.313218') RETURNING "id"
---
  def create
    @lesson.lesson_standards.create!(lesson_standard_params)

SELECT "lesson_standards".* FROM "lesson_standards" WHERE "lesson_standards"."lesson_id" = 4 AND "lesson_standards"."id" = 3 LIMIT 1
DELETE FROM "lesson_standards" WHERE "lesson_standards"."id" = 3
---
  def destroy
    @lesson_standard = @lesson.lesson_standards.find(params[:id])
    @lesson_standard.destroy

SELECT "quarters".* FROM "quarters" WHERE "quarters"."id" = 1 LIMIT 1
---
  def set_quarter
    @quarter = Quarter.find(params[:quarter_id])

SELECT "lessons".* FROM "lessons" WHERE "lessons"."quarter_id" = 1 AND "lessons"."id" = 4 LIMIT 1
---
  def set_lesson
    @lesson = @quarter.lessons.find(params[:lesson_id])