app/controllers/summative_assignments_controller.rb

SELECT "quarters".* FROM "quarters" WHERE "quarters"."id" = 1 LIMIT 1
---
  def set_quarter
    @quarter = Quarter.find(params[:quarter_id])

SELECT "lessons".* FROM "lessons" WHERE "lessons"."quarter_id" = 1 AND "lessons"."id" = 5 LIMIT 1
---
  def set_lesson
    @lesson = @quarter.lessons.find(params[:lesson_id])

SELECT "summative_assignments".* FROM "summative_assignments" WHERE "summative_assignments"."lesson_id" = 5 AND "summative_assignments"."id" = 1 LIMIT 1
---
  def set_summative_assignment
    @summative_assignment = @lesson.summative_assignments.find(params[:id])